function drowEcharts(titleStr,datasArrs,elementId,seriesType){
 // 基于准备好的dom，初始化echarts实例
 var myChart = echarts.init(document.getElementById(elementId));
 // 指定图表的配置项和数据
 var option = {
     color:['#c1c500', '#46f303',  '#cd00d7'],
     //全局的字体样式。
     textStyle:{
         color:'#FFFFFF',
     },
     title: {
         text:titleStr,
         textStyle:{
             color:'#FFFFFF',
             fontStyle:'normal',//'normal''italic' 'oblique'
             fontSize:'30',
             fontWeight:'normal'
         },
         left:'3%',
         top:'2%',
         padding: [5, 120,5,120],//边距
         backgroundColor:'#908301',//背景颜色
         borderRadius: [0, 50,50, 0]//圆角半径
     },
     //图例组件。
     legend: {
         bottom:'1%',
         data:['库存','入库','出库'],
         textStyle:{
             color:'#FFFFFF',
         }
     },
     grid: {
         left: '5%',     //图表距离左右上下之间的距离
         right: '5%',
         top: '15%',
         //bottom: '13%',
         containLabel: true
     },
     toolbox: {
         show: true,
         feature: {
             magicType: {
                 type: ['line', 'bar', 'stack']
             },
             dataView: {readOnly: false},//数据视图
             restore: {},//刷新
             saveAsImage: {},//保存图片
         }
     },
     tooltip: {
         trigger: 'axis',
         axisPointer: {
             type: 'shadow'
         }
     },
     xAxis: {
         data: datasArrs[0],
     },
     yAxis: {
         splitNumber:8,
         length:10
     },
     series: [{
         name: '库存',
         type: seriesType,
         barGap: 0,
         data: datasArrs[1],
     },
     {
         name: '入库',
         type: seriesType,
         data: datasArrs[2],
     },
     {
         name: '出库',
         type: seriesType,
         data: datasArrs[3]
     }]
 };
 if (option && typeof option === "object") {
     myChart.setOption(option, true);
 }
}

$(function(){
    var datasArrs1=[
        ['第1周','第2周','第3周','第4周','第5周','第6周','第7周','第8周','第9周','第10周','第11周','第12周','第13周','第14周','第15周','第16周','第17周','第18周','第19周','第20周','第21周','第22周','第23周','第24周','第25周','第26周','第27周','第28周','第29周','第30周','第31周','第32周','第33周','第34周','第35周','第36周','第37周','第38周','第39周','第40周','第41周','第42周','第43周','第44周','第45周','第46周','第47周','第48周','第49周','第50周','第51周','第52周',],
        [8184,888,4180,9120,8993,9128,6323,4609,4311,8893,4663,7588,5111,978,486,8563,7897,8221,7229,3165,2478,2912,1095,8841,4663,8929,2594,429,2465,8492,2823,5078,2112,7495,6793,3071,1930,3927,3625,8706,8002,1086,104,4592,5374,995,9707,3469,2574,3711,3975,3981,],
        [5177,5071,6904,687,6289,8826,5873,4066,7904,9076,4580,3241,7339,5465,4403,2736,7203,6681,697,4703,5676,7465,9608,9724,6290,567,9185,2578,2832,7848,5812,4155,5535,4083,3236,7076,9277,2948,6905,541,3164,7099,667,9386,3583,3336,6443,3440,9565,9398,9980,5878,],
        [137,1124,7443,3444,8230,7410,8245,7196,4676,5708,9271,9723,8821,2611,4452,3663,9393,2535,1487,6795,379,2420,4456,971,1878,1953,7044,5735,5182,6892,6144,2580,4638,7712,9718,2506,6255,7054,5973,7781,4476,7200,3149,8616,4043,3178,491,6869,3467,7973,1383,1790,],
    ];
    var datasArrs2=[
        ['09月1号','09月2号','09月3号','09月4号','09月5号','09月6号','09月7号','09月8号','09月9号','09月10号','09月11号','09月12号','09月13号','09月14号','09月15号','09月16号','09月17号','09月18号','09月19号','09月20号','09月21号','09月22号','09月23号','09月24号','09月25号','09月26号','09月27号','09月28号','09月29号','09月30号'],
        [1464,8006,6743,1820,4383,7651,2463,2838,1487,2017,8105,6431,7995,9105,9594,2607,459,2944,3817,127,3692,9977,2758,5954,9979,6376,2710,4843,5468,7383],
        [2412,5164,2343,6733,243,2281,3830,1935,1149,1785,1221,8474,2068,3242,9646,8145,3315,79,2676,8682,3751,6159,3523,2459,4054,1073,6393,5007,37,1250],
        [4018,8475,803,9935,1327,7328,4415,5801,2870,9509,3213,9239,6167,9360,6868,6427,672,9538,5046,5944,5921,1172,1494,1495,1089,5023,7511,1814,9612,504]
    ]; 
    
    var datasArrs3=[
        ['第1月','第2月','第3月','第4月','第5月','第6月','第7月','第8月','第9月','第10月','第11月','第12月',],
        [8394,8274,8468,227,9582,9797,4901,8427,750,7554,6805,4174,],
        [902,9314,562,6765,4323,833,1101,8024,2561,6236,7783,3250,],
        [7848,3379,383,674,6114,9919,5181,3025,4976,685,1696,4117,]  
    ];
    drowEcharts('汇总显示(年/周)',datasArrs1,'container-1','line');
    drowEcharts('汇总显示(月/日)',datasArrs2,'container-2','bar');
    drowEcharts('汇总显示(年/月)',datasArrs3,'container-3','bar');
})

