$(function(){
 // 基于准备好的dom，初始化echarts实例
var myChart = echarts.init(document.getElementById('container-1'));

 

// 指定图表的配置项和数据
var option = {
    color: ['#003366', '#006699', '#4cabce', '#e5323e'],
    tooltip: {
        trigger: 'axis',
        axisPointer: {
            type: 'shadow'
        }
    },
    title: {
        text: '汇总显示(月/日)'
    },
     legend: {
        data:['库存','入库','出库']
    },
    xAxis: {
        data: ['09月1号','09月2号','09月3号','09月4号','09月5号','09月6号','09月7号','09月8号','09月9号','09月10号','09月11号','09月12号','09月13号','09月14号','09月15号','09月16号','09月17号','09月18号','09月19号','09月20号','09月21号','09月22号','09月23号','09月24号','09月25号','09月26号','09月27号','09月28号','09月29号','09月30号']
    },
    yAxis: {},
    series: [{
        name: '库存',
        type: 'bar',
        barGap: 0,
        data: [1464,8006,6743,1820,4383,7651,2463,2838,1487,2017,8105,6431,7995,9105,9594,2607,459,2944,3817,127,3692,9977,2758,5954,9979,6376,2710,4843,5468,7383]
    },
    {
        name: '入库',
        type: 'bar',
        data: [2412,5164,2343,6733,243,2281,3830,1935,1149,1785,1221,8474,2068,3242,9646,8145,3315,79,2676,8682,3751,6159,3523,2459,4054,1073,6393,5007,37,1250]
    },
    {
        name: '出库',
        type: 'bar',
        data: [4018,8475,803,9935,1327,7328,4415,5801,2870,9509,3213,9239,6167,9360,6868,6427,672,9538,5046,5944,5921,1172,1494,1495,1089,5023,7511,1814,9612,504]
    }]
};

if (option && typeof option === "object") {
    myChart.setOption(option, true);
}
})